In [1]:
import pandas as pd
import numpy as np

# Task 1: Create a dictionary of city and their respective zip codes. Then ask zip code from user and provide the name of city.

In [3]:
d={'69000':'Mirpurkhas', '1229':'Hyderabad','3445':'Karachi','667':'Lahor' }
a=input("Enter Zipcod ")
print(d[a])

Enter Zipcod 667
Lahor

# task 2  Dictionary           Ask five names and their respective marks in first year

In [4]:
data = { 'name' : ['shoaban Ali', 'Waseem Ali', 'Anas','Mahabat','Danish'],
'first year marks' : ['1250', '1050', '950','850','750'],
'total Marks' : [100, 80, 90,70,60],
'average marks' : [12.3, 10.3, 9.3,8.3,7.3]
}
df = pd.DataFrame(data)
df

          name first year marks  total Marks  average marks
0  shoaban Ali             1250          100           12.3
1   Waseem Ali             1050           80           10.3
2         Anas              950           90            9.3
3      Mahabat              850           70            8.3
4       Danish              750           60            7.3

# (A)     Ask five names and their respective marks in first year

# B. Calculate and print total marks of all students

# C. Calculate and print average marks of all students